{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enhance romantic microsite with mature aesthetic, music, kiss marks, and animations",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add visible red lipstick kiss mark pattern to the letter background that decorates the paper texture without obscuring the letter text",
      "acceptanceCriteria": [
        "Red lipstick kiss marks are clearly visible on the letter background",
        "Kiss marks are subtle enough to not interfere with text readability",
        "Pattern appears on the paper-textured background beneath the letter text"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add CSS styles and SVG pattern definition for red lipstick kiss marks overlaying the letter background. Position kiss marks with appropriate opacity and z-index to maintain text readability while providing visible decoration on the paper texture."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Integrate royalty-free romantic background music that plays after the envelope opens",
      "acceptanceCriteria": [
        "Background music plays automatically after envelope opens",
        "Music is royalty-free and suitable for romantic occasions",
        "Music volume is set appropriately (around 25%)",
        "Mute/unmute toggle controls work correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add audio element with royalty-free romantic music source (e.g., from Free Music Archive or YouTube Audio Library), implement autoplay after envelope opens, set volume to 0.25, and add mute/unmute toggle button with icon in fixed position on screen."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Redesign color scheme from predominantly pink to a mature romantic aesthetic with varied elegant colors including reds, golds, deep purples, and whites while maintaining romantic feel",
      "acceptanceCriteria": [
        "Color palette uses sophisticated romantic colors beyond just pink",
        "Design feels mature and elegant rather than childish",
        "Visual theme maintains romantic atmosphere without excessive pink dominance",
        "Gradient backgrounds and UI elements use the updated color scheme"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update CSS color variables and gradient definitions throughout the document. Replace pink-dominant gradients with sophisticated combinations of deep reds (#8B0000, #DC143C), rich golds (#FFD700, #DAA520), elegant purples (#4B0082, #6A0DAD), and clean whites (#FFFFFF, #FFF8F0). Apply to backgrounds, buttons, particles, and UI elements while maintaining visual hierarchy and romantic atmosphere."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Enhance firecracker burst animation at intro screen to be more dramatic and realistic with particle effects and sound",
      "acceptanceCriteria": [
        "Firecracker burst animation is prominent and visually impressive",
        "Particles burst outward with realistic physics and timing",
        "Animation plays immediately when intro screen loads",
        "Burst effect precedes the 'Happy Birthday Angel' text reveal"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Enhance the existing firecracker animation with increased particle count, varied burst directions using radial patterns, realistic acceleration and deceleration physics, staggered timing for multiple bursts, and enhanced visual effects with glowing trails and color variations matching the mature color scheme (reds, golds, purples). Ensure animation triggers on page load before birthday text reveal."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add animated bouquet giving sequence that plays after the question flow and before or during the envelope reveal",
      "acceptanceCriteria": [
        "Animated bouquet appears and presents itself to the user",
        "Animation shows a giving/presenting motion",
        "Timing integrates smoothly between question flow and envelope sequence",
        "Bouquet visual matches the mature romantic aesthetic"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add bouquet animation sequence that displays the generated image frontend/public/assets/generated/bouquet.dim_800x800.png with slide-up and present motion using CSS transforms and keyframes. Position the animation to play after the final question is answered and before the envelope reveal begins. Include fade-in, scale-up, and gentle floating motion to create a romantic presentation effect."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Implement flying butterfly animations throughout the microsite with natural flight patterns and wing movements",
      "acceptanceCriteria": [
        "Multiple butterflies animate with realistic flying motion across screens",
        "Butterfly wings flap naturally during flight",
        "Flight paths are varied and organic (not linear)",
        "Butterflies appear throughout different sections of the microsite",
        "Animation performance is smooth on mobile devices"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Create butterfly SVG elements with animated wings using CSS transforms for flapping motion. Implement multiple butterflies (3-5) with varied bezier curve flight paths across different screens (intro, questions, envelope, letter). Use CSS animations with random delays and durations for organic movement. Color butterflies to match the mature color scheme (deep purples, golds, reds). Optimize animation performance for mobile using transform and will-change properties."
        }
      ]
    }
  ]
}